Panda Week 1

In [88]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

Persiapan Data Frame

In [89]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  6  8  6  4
1  8  6  8  9  9
2  8  8  5  6  5
3  8  9  1  9  8
4  1  4  3  5  4

In [90]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

Menyertakan Prefix Kolom

In [91]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        2        6        8        6        4
1        8        6        8        9        9
2        8        8        5        6        5
3        8        9        1        9        8
4        1        4        3        5        4

Menyertakan Suffix Kolom

In [92]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        2        6        8        6        4
1        8        6        8        9        9
2        8        8        5        6        5
3        8        9        1        9        8
4        1        4        3        5        4

#02: Pemilihan baris (rows selection) pada Data Frame

Persiapan Data Frame

In [93]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  1  3  2  3  4
1  1  2  4  2  1
2  3  4  2  4  1
3  3  2  1  2  3
4  1  3  3  4  3
5  4  2  4  2  4
6  2  1  1  1  3
7  2  4  4  2  2
8  4  1  2  3  4
9  1  4  3  3  3

Selection dengan operator logika |

In [94]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  1  3  2  3  4
1  1  2  4  2  1
2  3  4  2  4  1
3  3  2  1  2  3
4  1  3  3  4  3
9  1  4  3  3  3

Selection dengan fungsi isin()

In [95]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
0  1  3  2  3  4
1  1  2  4  2  1
2  3  4  2  4  1
3  3  2  1  2  3
4  1  3  3  4  3
9  1  4  3  3  3

Mengenal operator negasi ~

In [96]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
5  4  2  4  2  4
6  2  1  1  1  3
7  2  4  4  2  2
8  4  1  2  3  4

#03: Konversi tipe data String ke Numerik pada kolom Data Frame

Persiapan Data Frame

In [97]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

Konversi tipe data dengan fungsi astype()

In [98]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [99]:
df_x.dtypes

col1    object
col2     int64
dtype: object

Konversi tipe data numerik dengan fungsi to_numeric()

In [100]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

Persiapan Data Frame

In [101]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00          3.0          8    A
1 2024-10-01 01:00:00         15.0         11    B
2 2024-10-01 02:00:00          2.0         11    C
3 2024-10-01 03:00:00         11.0          1    D
4 2024-10-01 04:00:00          7.0         13    E

In [102]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Memilih kolom bertipe data numerik

In [103]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          3.0          8
1         15.0         11
2          2.0         11
3         11.0          1
4          7.0         13

In [104]:
df.select_dtypes(include='float')

   bil_pecahan
0          3.0
1         15.0
2          2.0
3         11.0
4          7.0

In [105]:
df.select_dtypes(include='int')

   bil_bulat
0          8
1         11
2         11
3          1
4         13


Memilih kolom bertipe data string atau object

In [106]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E


Memilih kolom bertipe data datetime

In [107]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

Memilih kolom dengan kombinasi tipe data

In [108]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          3.0          8    A
1         15.0         11    B
2          2.0         11    C
3         11.0          1    D
4          7.0         13    E